<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>网站介绍</title>
    <style>
        p {
            color: #787878;
            text-indent:2em;
        }
        li {
            text-indent: 2em;
            list-style: none;
        }
        ul {
            padding-left: 0px;
        }
    </style>
</head>
<body>
<h1 style="color: forestgreen;">
    网站介绍
</h1>
<p>
    1》宜租是一个在线短租预订平台，更是一个具有人情味的社交住宿社区。在很多城市拥有大量房源，包括民宿、四合院、洋房、酒店公寓、海边小屋、树屋、花店、书店等，让您充分感受住宿之美、人情之暖、分享之乐，并在居住中体会现代化的理念——居住自由主义。
</p>
<h4 style="color: red;">对于房客：</h4>
<p>
    实地验真、实拍，确保房源的真实可靠。
</p>
<p>
    当入住发生“预订房间无法入住”、“房间及设施与照片不符”、“房东临时提价”等情况时，“房客保障计划”会为房客排忧解难，确保安心入住。

</p>
<h4 style="color: red;">对于房东：</h4>
<p>
    宜租为有闲置房源、房间的房东，提供免费的分享推广平台，房东不用支付任何费用就可轻松发布房源信息。
</p>
<p>
    《家庭财产综合保险》，为房东保驾护航，全面保障个人房东的财产安全。
</p>
<p>
    宜租保洁为房东提供贴心周到的保洁服务。
</p>
<p>
    线上运营及线下管理团队，会为房东提供专业的服务，并定期邀请房东参加营销推广活动，确保房东获得收益。
</p>
<h4 style="color: red;">我们为您带来</h4>
<h5>1、家庭出游新选择：</h5>
<ul>
    <li>
        1）自驾游、自助游住宿首选，尤其适合家庭游、闺蜜游、团建等多人游群体的旅游住宿；
    </li>
    <li>
        2）独栋别墅、酒店式公寓、民宿、客栈、四合院、木屋、树屋、房车、帐篷等多种房型；
    </li>
    <li>
        3）“一站式”旅行服务，景点门票优惠及代买、接送机、租车、本地导游等；
    </li>
    <li>
        4）"私人定制"旅行攻略，房东推荐只有当地人才知道的特色餐馆， 只有当地人才会去的度假景区，令您的自由行与众不同；
    </li>
    <li>
        5）超乎想象的性价比，1套短租房=2间酒店房间，比同等酒店便宜50%，花一半的钱，住更舒适的房；
    </li>
</ul>
<h5>
    2、方便快捷的预订方式：
</h5>
<ul>
    <li>
        1）“临海房”、“主题公园房”、“周边游房”、“毕业旅行房”等各种专题房源，通过专题入口能轻松地选到满意的独栋别墅、酒店式公寓、民宿、客栈、四合院、木屋、树屋、房车、帐篷等；
    </li>
    <li>
        2）“一键选房”，房客一键发布房源需求，系统自动推送给符合条件的房东，坐等一大波好房来供您选择；
    </li>
    <li>
        3）如果对房源细节还有疑惑，可通过手机客户端与房东随时沟通。蚂蚁短租为优秀房东开通电话直拨功能令沟通更方便；
    </li>
    <li>
        4）支付方式自由选，信用卡、储蓄卡、微信、支付宝；
    </li>
</ul>

</body>
</html>