<?php

use Illuminate\Database\Seeder;

class AdminInitSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \App\Models\Admin\AdminUser::truncate();
        \App\Models\Admin\Permission::truncate();
        \DB::select(
            <<<SQL
                INSERT INTO `admin_permissions` (`id`, `name`, `label`, `description`, `cid`, `icon`, `created_at`, `updated_at`)
VALUES
	(1, 'admin.permission', '权限管理', '', 0, 'fa-users', '2016-05-21 10:06:50', '2016-06-22 13:49:09'),
	(2, 'admin.permission.index', '权限列表', '', 1, '', '2016-05-21 10:08:04', '2016-05-21 10:08:04'),
	(3, 'admin.permission.create', '权限添加', '', 1, '', '2016-05-21 10:08:18', '2016-05-21 10:08:18'),
	(4, 'admin.permission.edit', '权限修改', '', 1, '', '2016-05-21 10:08:35', '2016-05-21 10:08:35'),
	(5, 'admin.permission.destroy ', '权限删除', '', 1, '', '2016-05-21 10:09:57', '2016-05-21 10:09:57'),
	(6, 'admin.role.index', '角色列表', '', 1, '', '2016-05-23 10:36:40', '2016-05-23 10:36:40'),
	(7, 'admin.role.create', '角色添加', '', 1, '', '2016-05-23 10:37:07', '2016-05-23 10:37:07'),
	(8, 'admin.role.edit', '角色修改', '', 1, '', '2016-05-23 10:37:22', '2016-05-23 10:37:22'),
	(9, 'admin.role.destroy', '角色删除', '', 1, '', '2016-05-23 10:37:48', '2016-05-23 10:37:48'),
	(10, 'admin.user.index', '用户管理', '', 1, '', '2016-05-23 10:38:52', '2016-05-23 10:38:52'),
	(11, 'admin.user.create', '用户添加', '', 1, '', '2016-05-23 10:39:21', '2016-06-22 13:49:29'),
	(12, 'admin.user.edit', '用户编辑', '', 1, '', '2016-05-23 10:39:52', '2016-05-23 10:39:52'),
	(13, 'admin.user.destroy', '用户删除', '', 1, '', '2016-05-23 10:40:36', '2016-05-23 10:40:36'),
    (14, 'admin.maintenance', '网站维护', '网站维护功能', 0, 'fa-tasks', '2017-4-1 07:50:03', '2017-4-1 07:50:03'),
    (15, 'admin.comment.index', '点评列表', '差评中评管理', 14, '', '2017-4-1 07:51:29', '2017-4-1 07:51:29'),
    (16, 'admin.comment.show', '点评展示', '', 14, '', '2017-4-2 13:05:30', '2017-4-2 13:05:30'),
    (17, 'admin.comment.delete', '点评删除', '', 14, '', '2017-4-2 13:05:52', '2017-4-2 13:05:52'),
    (18, 'admin.house.index', '房源列表', '', 14, '', '2017-4-2 14:37:43', '2017-4-2 14:37:43'),
    (19, 'admin.house.edit', '房源审核', '', 14, '', '2017-4-2 14:50:01', '2017-4-2 14:50:01'),
    (20, 'admin.house.show', '房源信息展示', '', 14, '', '2017-4-2 16:34:53', '2017-4-2 16:34:53'),
    (21, 'admin.house.upload', '房源照片上传', '', 14, '', '2017-4-2 16:35:22', '2017-4-2 16:35:22'),
    (22, 'admin.index', '首页管理', '', 0, 'fa-home', '2017-4-4 13:19:55', '2017-4-4 13:19:55'),
    (23, 'admin.slide.index', '轮播列表', '', 23, '', '2017-4-4 13:20:29', '2017-4-4 13:20:29'),
    (24, 'admin.slide.edit', '轮播编辑页面', '', 23, '', '2017-4-4 15:14:57', '2017-4-4 15:14:57'),
    (25, 'admin.slide.create', '轮播创建页面', '', 23, '', '2017-4-4 15:15:22', '2017-4-4 15:15:22'),
    (26, 'admin.slide.store', '轮播编辑', '', 23, '', '2017-4-4 15:15:45', '2017-4-4 15:15:45'),
    (27, 'admin.city.index', '推荐城市列表', '', 23, '', '2017-4-4 15:16:19', '2017-4-4 15:16:19'),
    (28, 'admin.city.edit', '推荐城市编辑页面', '', 23, '', '2017-4-4 15:47:06', '2017-4-4 15:47:06'),
    (29, 'admin.city.create', '推荐城市新增页面', '', 23, '', '2017-4-4 15:47:26', '2017-4-4 15:47:26'),
    (30, 'admin.city.store', '推荐城市编辑', '', 23, '', '2017-4-4 15:48:02', '2017-4-4 15:48:02');
SQL
        );
        $admin = new \App\Models\Admin\AdminUser();
        $admin->
        id = 1;
        $admin->name = 'root';
        $admin->email = 'root@admin.com';
        $admin->password = bcrypt('root');
        $admin->save();
    }
}
